[
  {
    "category": "News",
    "title": "Multi-Agent SQL Assistant, Part 2: Building a RAG Manager",
    "source": "towardsdatascience.com",
    "date": "2025-11-06",
    "summary": "A hands-on guide to comparing multiple RAG strategies — Keyword, FAISS, and Chroma The post Multi-Agent SQL Assistant, Part 2: Building a RAG Manager appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/multi-agent-sql-assistant-part-2-building-a-rag-manager/"
  },
  {
    "category": "News",
    "title": "We Didn’t Invent Attention — We Just Rediscovered It",
    "source": "towardsdatascience.com",
    "date": "2025-11-05",
    "summary": "How selective amplification emerged across evolution, chemistry, and AI through convergent mathematical solutions The post We Didn’t Invent Attention — We Just Rediscovered It appeared first on Toward…",
    "link": "https://towardsdatascience.com/we-didnt-invent-attention-we-just-rediscovered-it/"
  },
  {
    "category": "News",
    "title": "AI Papers to Read in 2025",
    "source": "towardsdatascience.com",
    "date": "2025-11-05",
    "summary": "Reading suggestions to keep you up-to-date with the latest and classic breakthroughs in AI and Data Science. The post AI Papers to Read in 2025 appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/ai-papers-to-read-in-2025/"
  },
  {
    "category": "News",
    "title": "How to Evaluate Retrieval Quality in RAG Pipelines (part 2): Mean Reciprocal Rank (MRR) and Average Precision (AP)",
    "source": "towardsdatascience.com",
    "date": "2025-11-05",
    "summary": "Evaluating the retrieval quality of your RAG pipeline with binary, order-aware measures The post How to Evaluate Retrieval Quality in RAG Pipelines (part 2): Mean Reciprocal Rank (MRR) and Average Pre…",
    "link": "https://towardsdatascience.com/how-to-evaluate-retrieval-quality-in-rag-pipelines-part-2-mean-reciprocal-rank-mrr-and-average-precision-ap/"
  },
  {
    "category": "News",
    "title": "Why Nonparametric Models Deserve a Second Look",
    "source": "towardsdatascience.com",
    "date": "2025-11-05",
    "summary": "Discover how nonparametric conditional distributions unify regression, classification, and synthetic data generation—without assuming functional forms. The post Why Nonparametric Models Deserve a Seco…",
    "link": "https://towardsdatascience.com/why-nonparametric-models-deserve-a-second-look/"
  },
  {
    "category": "News",
    "title": "How Amazon Search increased ML training twofold using AWS Batch for Amazon SageMaker Training jobs",
    "source": "aws.amazon.com",
    "date": "2025-11-05",
    "summary": "In this post, we show you how Amazon Search optimized GPU instance utilization by leveraging AWS Batch for SageMaker Training jobs. This managed solution enabled us to orchestrate machine learning (ML…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-amazon-search-increased-ml-training-twofold-using-aws-batch-for-amazon-sagemaker-training-jobs/"
  },
  {
    "category": "News",
    "title": "Iterate faster with Amazon Bedrock AgentCore Runtime direct code deployment",
    "source": "aws.amazon.com",
    "date": "2025-11-04",
    "summary": "Amazon Bedrock AgentCore is an agentic platform for building, deploying, and operating effective agents securely at scale. Amazon Bedrock AgentCore Runtime is a fully managed service of Bedrock AgentC…",
    "link": "https://aws.amazon.com/blogs/machine-learning/iterate-faster-with-amazon-bedrock-agentcore-runtime-direct-code-deployment/"
  },
  {
    "category": "News",
    "title": "How Switchboard, MD automates real-time call transcription in clinical contact centers with Amazon Nova Sonic",
    "source": "aws.amazon.com",
    "date": "2025-11-03",
    "summary": "In this post, we examine the specific challenges Switchboard, MD faced with scaling transcription accuracy and cost-effectiveness in clinical environments, their evaluation process for selecting the r…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-switchboard-md-automates-real-time-call-transcription-in-clinical-contact-centers-with-amazon-nova-sonic/"
  },
  {
    "category": "News",
    "title": "Build reliable AI systems with Automated Reasoning on Amazon Bedrock – Part 1",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "Enterprises in regulated industries often need mathematical certainty that every AI response complies with established policies and domain knowledge. Regulated industries can’t use traditional quality…",
    "link": "https://aws.amazon.com/blogs/machine-learning/build-reliable-ai-systems-with-automated-reasoning-on-amazon-bedrock-part-1/"
  },
  {
    "category": "News",
    "title": "Custom Intelligence: Building AI that matches your business DNA",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "In 2024, we launched the Custom Model Program within the AWS Generative AI Innovation Center to provide comprehensive support throughout every stage of model customization and optimization. Over the p…",
    "link": "https://aws.amazon.com/blogs/machine-learning/custom-intelligence-building-ai-that-matches-your-business-dna/"
  },
  {
    "category": "News",
    "title": "Power BI semantic models as accelerators for AI-enabled consumption",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-05",
    "summary": "As data volumes grow exponentially, Power BI customers demand AI-driven analytical solutions that scale to petabytes, are secure, governed, and easy to manage. Power BI semantic models, backed by Micr…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-semantic-models-as-accelerators-for-ai-enabled-consumption/"
  },
  {
    "category": "News",
    "title": "Advance your career in Data &amp; AI with Microsoft Fabric Data Days",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-03",
    "summary": "There’s no AI without data. Are you ready to invest in your future? Fabric Data Days starts on November 4th! We’re offering 50+ days of immersive learning designed for data professionals at every leve…",
    "link": "https://powerbi.microsoft.com/en-us/blog/advance-your-career-in-data-ai-with-microsoft-fabric-data-days/"
  },
  {
    "category": "News",
    "title": "Preparing for the General Availability of the new Card visual",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-29",
    "summary": "One change may impact the behavior and look of the new card visual in existing reports. The callout size and background setting will be available with or without a divider after GA.…",
    "link": "https://powerbi.microsoft.com/en-us/blog/prepare-for-new-card-visual/"
  },
  {
    "category": "News",
    "title": "Power BI app Copilot: AI scoped to the curated content in an app (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "Announcing Power BI app Copilot, now in preview. With app-scoped Copilot, users can search for reports in an app plus ask questions and get connected with answers based on a report in an app. App Copi…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-app-copilot-ai-scoped-to-the-curated-content-in-an-app-preview/"
  },
  {
    "category": "News",
    "title": "Deprecation Announcement: Office Online Server Retirement and What it Means for Power BI Report Server Users",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "What’s Changing? Microsoft has announced that Office Online Server (OOS) will be retired effective December 31, 2026. As a result, PBIRS users will no longer be able to host Excel workbooks in PBIRS u…",
    "link": "https://powerbi.microsoft.com/en-us/blog/deprecation-announcement-office-online-server-retirement-and-what-it-means-for-power-bi-report-server-users/"
  }
]