[
  {
    "category": "News",
    "title": "Why I’m Making the Switch to marimo Notebooks",
    "source": "towardsdatascience.com",
    "date": "2025-11-20",
    "summary": "A fresh way to think about computational notebooks The post Why I’m Making the Switch to marimo Notebooks appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/why-im-making-the-switch-to-marimo-notebooks/"
  },
  {
    "category": "News",
    "title": "How to Perform Agentic Information Retrieval",
    "source": "towardsdatascience.com",
    "date": "2025-11-19",
    "summary": "Learn how to utilize AI agents to find information in your document corpus The post How to Perform Agentic Information Retrieval appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/how-to-perform-agentic-information-retrieval/"
  },
  {
    "category": "News",
    "title": "Developing Human Sexuality in the Age of AI",
    "source": "towardsdatascience.com",
    "date": "2025-11-19",
    "summary": "How we learn is changing with generative AI — what does that mean for sex education, consent, and responsibility? The post Developing Human Sexuality in the Age of AI appeared first on Towards Data Sc…",
    "link": "https://towardsdatascience.com/developing-human-sexuality-in-the-age-of-ai/"
  },
  {
    "category": "News",
    "title": "PyTorch Tutorial for Beginners: Build a Multiple Regression Model from Scratch",
    "source": "towardsdatascience.com",
    "date": "2025-11-19",
    "summary": "Hands-on PyTorch: Building a 3-layer neural network for multiple regression The post PyTorch Tutorial for Beginners: Build a Multiple Regression Model from Scratch appeared first on Towards Data Scien…",
    "link": "https://towardsdatascience.com/pytorch-tutorial-for-beginners-build-a-multiple-regression-model-from-scratch/"
  },
  {
    "category": "News",
    "title": "Making Smarter Bets: Towards a Winning AI Strategy with Probabilistic Thinking",
    "source": "towardsdatascience.com",
    "date": "2025-11-19",
    "summary": "Practical guidance on identifying opportunities, managing product portfolios, and overcoming behavioral biases The post Making Smarter Bets: Towards a Winning AI Strategy with Probabilistic Thinking a…",
    "link": "https://towardsdatascience.com/making-smarter-bets-towards-a-winning-ai-strategy-with-probabilistic-thinking/"
  },
  {
    "category": "News",
    "title": "Claude Code deployment patterns and best practices with Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-19",
    "summary": "In this post, we explore deployment patterns and best practices for Claude Code with Amazon Bedrock, covering authentication methods, infrastructure decisions, and monitoring strategies to help enterp…",
    "link": "https://aws.amazon.com/blogs/machine-learning/claude-code-deployment-patterns-and-best-practices-with-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Amazon Bedrock Guardrails expands support for code domain",
    "source": "aws.amazon.com",
    "date": "2025-11-19",
    "summary": "Amazon Bedrock Guardrails now extends its safety controls to protect code generation across twelve programming languages, addressing critical security challenges in AI-assisted software development. I…",
    "link": "https://aws.amazon.com/blogs/machine-learning/amazon-bedrock-guardrails-expands-support-for-code-domain/"
  },
  {
    "category": "News",
    "title": "Announcing the AWS Well-Architected Responsible AI Lens ",
    "source": "aws.amazon.com",
    "date": "2025-11-19",
    "summary": "Today, we're announcing the AWS Well-Architected Responsible AI Lens—a set of thoughtful questions and corresponding best practices that help builders address responsible AI concerns throughout develo…",
    "link": "https://aws.amazon.com/blogs/machine-learning/announcing-the-aws-well-architected-responsible-ai-lens/"
  },
  {
    "category": "News",
    "title": "How Amazon uses AI agents to support compliance screening of billions of transactions per day",
    "source": "aws.amazon.com",
    "date": "2025-11-19",
    "summary": "Amazon's AI-powered Amazon Compliance Screening system tackles complex compliance challenges through autonomous agents that analyze, reason through, and resolve cases with precision. This blog post ex…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-amazon-uses-ai-agents-to-support-compliance-screening-of-billions-of-transactions-per-day/"
  },
  {
    "category": "News",
    "title": "Build an agentic solution with Amazon Nova, Snowflake, and LangGraph",
    "source": "aws.amazon.com",
    "date": "2025-11-19",
    "summary": "In this post, we cover how you can use tools from Snowflake AI Data Cloud and Amazon Web Services (AWS) to build generative AI solutions that organizations can use to make data-driven decisions, incre…",
    "link": "https://aws.amazon.com/blogs/machine-learning/build-an-agentic-solution-with-amazon-nova-snowflake-and-langgraph/"
  },
  {
    "category": "News",
    "title": "Standalone Copilot in Power BI mobile apps: Chat with your data anytime anywhere (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-19",
    "summary": "We’re excited to announce the release of the Standalone Copilot experience in Power BI Mobile apps! Copilot in Power BI on mobile is a new way to get insights from your Power BI data. You no longer ha…",
    "link": "https://powerbi.microsoft.com/en-us/blog/standalone-copilot-in-power-bi-mobile-apps-chat-with-your-data-anytime-anywhere-preview/"
  },
  {
    "category": "News",
    "title": "Bringing Context Aware Intelligence to Power BI",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-18",
    "summary": "Ten years ago, Power BI entered the market and transformed how businesses interact with data. Before self-service BI, business users waited days, sometimes weeks, for IT teams to build reports and ans…",
    "link": "https://powerbi.microsoft.com/en-us/blog/bringing-context-aware-intelligence-to-power-bi/"
  },
  {
    "category": "News",
    "title": "Power BI November 2025 Feature Summary",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-18",
    "summary": "The November 2025 Power BI feature update brings several important announcements and enhancements across the platform. Key highlights include the deprecation of R and Python visuals in the Embed for y…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-november-2025-feature-summary/"
  },
  {
    "category": "News",
    "title": "PBIR will become the default Power BI Report Format &#8211; Get Ready for the Transition",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-17",
    "summary": "Starting in January 2026, all new reports created in both Power BI Service and Desktop will use the PBIR format by default, and existing reports will be automatically converted to PBIR when edited and…",
    "link": "https://powerbi.microsoft.com/en-us/blog/pbir-will-become-the-default-power-bi-report-format-get-ready-for-the-transition/"
  },
  {
    "category": "News",
    "title": "Microsoft named Leader and Outperformer in the 2025 GigaOm Radar for Semantic Layers &amp; Metric Stores ",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-11",
    "summary": "In today’s data-driven world, semantic models have become the backbone of trustworthy analytics. They define business logic, metrics, and relationships that turn raw data into meaningful, trusted and …",
    "link": "https://powerbi.microsoft.com/en-us/blog/microsoft-named-leader-and-outperformer-in-the-2025-gigaom-radar-for-semantic-layers-metric-stores/"
  }
]