[
  {
    "category": "News",
    "title": "Learning Triton One Kernel at a Time: Softmax",
    "source": "towardsdatascience.com",
    "date": "2025-11-23",
    "summary": "All you need to know about a fast, readable and PyTorch-ready softmax kernel The post Learning Triton One Kernel at a Time: Softmax appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/learning-triton-one-kernel-at-a-time-softmax/"
  },
  {
    "category": "News",
    "title": "Your Next ‘Large’ Language Model Might Not Be Large After All",
    "source": "towardsdatascience.com",
    "date": "2025-11-23",
    "summary": "A 27M-parameter model just outperformed giants like DeepSeek R1, o3-mini, and Claude 3.7 on reasoning tasks The post Your Next ‘Large’ Language Model Might Not Be Large After All appeared first on Tow…",
    "link": "https://towardsdatascience.com/your-next-large-language-model-might-not-be-large-afterall-2/"
  },
  {
    "category": "News",
    "title": "Empirical Mode Decomposition: The Most Intuitive Way to Decompose Complex Signals and Time Series",
    "source": "towardsdatascience.com",
    "date": "2025-11-22",
    "summary": "A step-by-step breakdown of empirical mode decomposition to help you extract patterns from time series The post Empirical Mode Decomposition: The Most Intuitive Way to Decompose Complex Signals and Ti…",
    "link": "https://towardsdatascience.com/preprocessing-signal-data-with-empirical-mode-decomposition/"
  },
  {
    "category": "News",
    "title": "Overfitting vs. Underfitting: Making Sense of the Bias-Variance Trade-Off",
    "source": "towardsdatascience.com",
    "date": "2025-11-22",
    "summary": "The best models live in the sweet spot: generalizing well, learning enough, but not too much The post Overfitting vs. Underfitting: Making Sense of the Bias-Variance Trade-Off appeared first on Toward…",
    "link": "https://towardsdatascience.com/overfitting-versus-underfitting/"
  },
  {
    "category": "News",
    "title": "Modern DataFrames in Python: A Hands-On Tutorial with Polars and DuckDB",
    "source": "towardsdatascience.com",
    "date": "2025-11-21",
    "summary": "How I learned to handle growing datasets without slowing down my entire workflow The post Modern DataFrames in Python: A Hands-On Tutorial with Polars and DuckDB appeared first on Towards Data Science…",
    "link": "https://towardsdatascience.com/modern-dataframes-in-python-a-hands-on-tutorial-with-polars-and-duckdb/"
  },
  {
    "category": "News",
    "title": "Streamline AI operations with the Multi-Provider Generative AI Gateway reference architecture",
    "source": "aws.amazon.com",
    "date": "2025-11-21",
    "summary": "In this post, we introduce the Multi-Provider Generative AI Gateway reference architecture, which provides guidance for deploying LiteLLM into an AWS environment to streamline the management and gover…",
    "link": "https://aws.amazon.com/blogs/machine-learning/streamline-ai-operations-with-the-multi-provider-generative-ai-gateway-reference-architecture/"
  },
  {
    "category": "News",
    "title": "Deploy geospatial agents with Foursquare Spatial H3 Hub and Amazon SageMaker AI",
    "source": "aws.amazon.com",
    "date": "2025-11-21",
    "summary": "In this post, you'll learn how to deploy geospatial AI agents that can answer complex spatial questions in minutes instead of months. By combining Foursquare Spatial H3 Hub's analysis-ready geospatial…",
    "link": "https://aws.amazon.com/blogs/machine-learning/deploy-geospatial-agents-with-foursquare-spatial-h3-hub-and-amazon-sagemaker-ai/"
  },
  {
    "category": "News",
    "title": "How Wipro PARI accelerates PLC code generation using Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-21",
    "summary": "In this post, we share how Wipro implemented advanced prompt engineering techniques, custom validation logic, and automated code rectification to streamline the development of industrial automation co…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-wipro-pari-accelerates-plc-code-generation-using-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "MSD explores applying generative Al to improve the deviation management process using AWS services",
    "source": "aws.amazon.com",
    "date": "2025-11-20",
    "summary": "This blog post has explores how MSD is harnessing the power of generative AI and databases to optimize and transform its manufacturing deviation management process. By creating an accurate and multifa…",
    "link": "https://aws.amazon.com/blogs/machine-learning/msd-explores-applying-generative-al-to-improve-the-deviation-management-process-using-aws-services/"
  },
  {
    "category": "News",
    "title": "Accelerating genomics variant interpretation with AWS HealthOmics and Amazon Bedrock AgentCore",
    "source": "aws.amazon.com",
    "date": "2025-11-20",
    "summary": "In this blog post, we show you how agentic workflows can accelerate the processing and interpretation of genomics pipelines at scale with a natural language interface. We demonstrate a comprehensive g…",
    "link": "https://aws.amazon.com/blogs/machine-learning/accelerating-genomics-variant-interpretation-with-aws-healthomics-and-amazon-bedrock-agentcore/"
  },
  {
    "category": "News",
    "title": "TMDL Visual Studio Code Extension (Generally Available)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-20",
    "summary": "This update brings DAX semantic highlighting support within TMDL documents alongside other enhanced authoring features like Power Query semantic highlighting, breadcrumb navigation, code actions, code…",
    "link": "https://powerbi.microsoft.com/en-us/blog/tmdl-visual-studio-code-extension-generally-available/"
  },
  {
    "category": "News",
    "title": "New Card visual in reports (Generally Available)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-20",
    "summary": "The new card visual now generally available brings a modern and visually engaging way to highlight key metrics in your reports, now with support for hero images, new defaults, and consistent formattin…",
    "link": "https://powerbi.microsoft.com/en-us/blog/deep-dive-into-the-new-card-visual-in-reports-generally-available/"
  },
  {
    "category": "News",
    "title": "Standalone Copilot in Power BI mobile apps: Chat with your data anytime anywhere (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-19",
    "summary": "We’re excited to announce the release of the Standalone Copilot experience in Power BI Mobile apps! Copilot in Power BI on mobile is a new way to get insights from your Power BI data. You no longer ha…",
    "link": "https://powerbi.microsoft.com/en-us/blog/standalone-copilot-in-power-bi-mobile-apps-chat-with-your-data-anytime-anywhere-preview/"
  },
  {
    "category": "News",
    "title": "Bringing Context Aware Intelligence to Power BI",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-18",
    "summary": "Ten years ago, Power BI entered the market and transformed how businesses interact with data. Before self-service BI, business users waited days, sometimes weeks, for IT teams to build reports and ans…",
    "link": "https://powerbi.microsoft.com/en-us/blog/bringing-context-aware-intelligence-to-power-bi/"
  },
  {
    "category": "News",
    "title": "Power BI November 2025 Feature Summary",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-18",
    "summary": "The November 2025 Power BI feature update brings several important announcements and enhancements across the platform. Key highlights include the deprecation of R and Python visuals in the Embed for y…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-november-2025-feature-summary/"
  }
]