[
  {
    "category": "News",
    "title": "Implementing the Rock Paper Scissors Game in Python",
    "source": "towardsdatascience.com",
    "date": "2025-11-27",
    "summary": "A beginner-friendly Python tutorial using conditionals and the random module The post Implementing the Rock Paper Scissors Game in Python appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/implementing-the-rock-paper-scissors-game-in-python/"
  },
  {
    "category": "News",
    "title": "I Cleaned a Messy CSV File Using Pandas .  Here’s the Exact Process I Follow Every Time.",
    "source": "towardsdatascience.com",
    "date": "2025-11-26",
    "summary": "Stop guessing at data cleaning. Use this repeatable 5-step Python workflow to diagnose and fix the most common data flaws. The post I Cleaned a Messy CSV File Using Pandas . Here’s the Exact Process I…",
    "link": "https://towardsdatascience.com/i-cleaned-a-messy-csv-file-using-pandas-heres-the-exact-process-i-follow-every-time/"
  },
  {
    "category": "News",
    "title": "RISAT’s Silent Promise: Decoding Disasters with Synthetic Aperture Radar",
    "source": "towardsdatascience.com",
    "date": "2025-11-26",
    "summary": "The high-resolution physics turning microwave echoes into real-time flood intelligence The post RISAT’s Silent Promise: Decoding Disasters with Synthetic Aperture Radar appeared first on Towards Data …",
    "link": "https://towardsdatascience.com/risats-silent-promise-decoding-disasters-with-synthetic-aperture-radar/"
  },
  {
    "category": "News",
    "title": "How I Use AI to Convince Companies to Adopt Sustainability",
    "source": "towardsdatascience.com",
    "date": "2025-11-26",
    "summary": "Discover how Claude can act as a Supply Chain Sustainability Analyst and guide companies toward greener, more efficient inventory management. The post How I Use AI to Convince Companies to Adopt Susta…",
    "link": "https://towardsdatascience.com/how-i-use-ai-to-convince-companies-to-adopt-sustainability/"
  },
  {
    "category": "News",
    "title": "Why CrewAI’s Manager-Worker Architecture Fails — and How to Fix It",
    "source": "towardsdatascience.com",
    "date": "2025-11-25",
    "summary": "A real-world analysis of why CrewAI’s hierarchical orchestration misfires—and a practical fix you can implement today. The post Why CrewAI’s Manager-Worker Architecture Fails — and How to Fix It appea…",
    "link": "https://towardsdatascience.com/why-crewais-manager-worker-architecture-fails-and-how-to-fix-it/"
  },
  {
    "category": "News",
    "title": "How Myriad Genetics achieved fast, accurate, and cost-efficient document processing using the AWS open-source Generative AI Intelligent Document Processing Accelerator",
    "source": "aws.amazon.com",
    "date": "2025-11-27",
    "summary": "In this post, we explore how Myriad Genetics partnered with the AWS Generative AI Innovation Center to transform their healthcare document processing pipeline using Amazon Bedrock and Amazon Nova foun…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-myriad-genetics-achieved-fast-accurate-and-cost-efficient-document-processing-using-the-aws-open-source-generative-ai-intelligent-document-processing-accelerator/"
  },
  {
    "category": "News",
    "title": "How CBRE powers unified property management search and digital assistant using Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-27",
    "summary": "In this post, CBRE and AWS demonstrate how they transformed property management by building a unified search and digital assistant using Amazon Bedrock, enabling professionals to access millions of do…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-cbre-powers-unified-property-management-search-and-digital-assistant-using-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Managed Tiered KV Cache and Intelligent Routing for Amazon SageMaker HyperPod",
    "source": "aws.amazon.com",
    "date": "2025-11-27",
    "summary": "In this post, we introduce Managed Tiered KV Cache and Intelligent Routing for Amazon SageMaker HyperPod, new capabilities that can reduce time to first token by up to 40% and lower compute costs by u…",
    "link": "https://aws.amazon.com/blogs/machine-learning/managed-tiered-kv-cache-and-intelligent-routing-for-amazon-sagemaker-hyperpod/"
  },
  {
    "category": "News",
    "title": "Apply fine-grained access control with Bedrock AgentCore Gateway interceptors",
    "source": "aws.amazon.com",
    "date": "2025-11-26",
    "summary": "We are launching a new feature: gateway interceptors for Amazon Bedrock AgentCore Gateway. This powerful new capability provides fine-grained security, dynamic access control, and flexible schema mana…",
    "link": "https://aws.amazon.com/blogs/machine-learning/apply-fine-grained-access-control-with-bedrock-agentcore-gateway-interceptors/"
  },
  {
    "category": "News",
    "title": "How Condé Nast accelerated contract processing and rights analysis with Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-26",
    "summary": "In this post, we explore how Condé Nast used Amazon Bedrock and Anthropic’s Claude to accelerate their contract processing and rights analysis workstreams. The company’s extensive portfolio, spanning …",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-conde-nast-accelerated-contract-processing-and-rights-analysis-with-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Image Visual Enhancements for Report Creators",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-24",
    "summary": "This update empowers report creators to craft more engaging experiences for report consumers. Report creators can easily maintain image visuals with more image formatting options, more image source op…",
    "link": "https://powerbi.microsoft.com/en-us/blog/image-visual-enhancements-for-report-creators/"
  },
  {
    "category": "News",
    "title": "TMDL Visual Studio Code Extension (Generally Available)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-20",
    "summary": "This update brings DAX semantic highlighting support within TMDL documents alongside other enhanced authoring features like Power Query semantic highlighting, breadcrumb navigation, code actions, code…",
    "link": "https://powerbi.microsoft.com/en-us/blog/tmdl-visual-studio-code-extension-generally-available/"
  },
  {
    "category": "News",
    "title": "New Card visual in reports (Generally Available)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-20",
    "summary": "The new card visual now generally available brings a modern and visually engaging way to highlight key metrics in your reports, now with support for hero images, new defaults, and consistent formattin…",
    "link": "https://powerbi.microsoft.com/en-us/blog/deep-dive-into-the-new-card-visual-in-reports-generally-available/"
  },
  {
    "category": "News",
    "title": "Standalone Copilot in Power BI mobile apps: Chat with your data anytime anywhere (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-19",
    "summary": "We’re excited to announce the release of the Standalone Copilot experience in Power BI Mobile apps! Copilot in Power BI on mobile is a new way to get insights from your Power BI data. You no longer ha…",
    "link": "https://powerbi.microsoft.com/en-us/blog/standalone-copilot-in-power-bi-mobile-apps-chat-with-your-data-anytime-anywhere-preview/"
  },
  {
    "category": "News",
    "title": "Bringing Context Aware Intelligence to Power BI",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-18",
    "summary": "Ten years ago, Power BI entered the market and transformed how businesses interact with data. Before self-service BI, business users waited days, sometimes weeks, for IT teams to build reports and ans…",
    "link": "https://powerbi.microsoft.com/en-us/blog/bringing-context-aware-intelligence-to-power-bi/"
  }
]