[
  {
    "category": "News",
    "title": "From Classical Models to AI: Forecasting Humidity for Energy and Water Efficiency in Data Centers",
    "source": "towardsdatascience.com",
    "date": "2025-11-02",
    "summary": "From ARIMA to N-BEATS: Comparing forecasting approaches that balance accuracy, interpretability, and sustainability The post From Classical Models to AI: Forecasting Humidity for Energy and Water Effi…",
    "link": "https://towardsdatascience.com/from-classical-models-to-ai-forecasting-humidity-for-energy-and-water-efficiency-in-data-centers-2/"
  },
  {
    "category": "News",
    "title": "MobileNetV3 Paper Walkthrough: The Tiny Giant Getting Even Smarter",
    "source": "towardsdatascience.com",
    "date": "2025-11-02",
    "summary": "MobileNetV3 with PyTorch — now featuring SE blocks and hard activation functions The post MobileNetV3 Paper Walkthrough: The Tiny Giant Getting Even Smarter appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/mobilenetv3-paper-walkthrough-the-tiny-giant-getting-even-smarter/"
  },
  {
    "category": "News",
    "title": "The Pearson Correlation Coefficient, Explained Simply",
    "source": "towardsdatascience.com",
    "date": "2025-11-01",
    "summary": "A simple explanation of the Pearson correlation coefficient with examples The post The Pearson Correlation Coefficient, Explained Simply appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/pearson-correlation-coefficient-explained-simply/"
  },
  {
    "category": "News",
    "title": "Graph RAG vs SQL RAG",
    "source": "towardsdatascience.com",
    "date": "2025-11-01",
    "summary": "Evaluating RAGs on graph and SQL databases The post Graph RAG vs SQL RAG appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/graph-rag-vs-sql-rag/"
  },
  {
    "category": "News",
    "title": "Let Hypothesis Break Your Python Code Before Your Users Do",
    "source": "towardsdatascience.com",
    "date": "2025-10-31",
    "summary": "Property-based tests that find bugs you didn’t know existed. The post Let Hypothesis Break Your Python Code Before Your Users Do appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/let-hypothesis-break-your-python-code-before-your-users-do/"
  },
  {
    "category": "News",
    "title": "Build reliable AI systems with Automated Reasoning on Amazon Bedrock – Part 1",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "Enterprises in regulated industries often need mathematical certainty that every AI response complies with established policies and domain knowledge. Regulated industries can’t use traditional quality…",
    "link": "https://aws.amazon.com/blogs/machine-learning/build-reliable-ai-systems-with-automated-reasoning-on-amazon-bedrock-part-1/"
  },
  {
    "category": "News",
    "title": "Custom Intelligence: Building AI that matches your business DNA",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "In 2024, we launched the Custom Model Program within the AWS Generative AI Innovation Center to provide comprehensive support throughout every stage of model customization and optimization. Over the p…",
    "link": "https://aws.amazon.com/blogs/machine-learning/custom-intelligence-building-ai-that-matches-your-business-dna/"
  },
  {
    "category": "News",
    "title": "Clario streamlines clinical trial software configurations using Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "This post builds upon our previous post discussing how Clario developed an AI solution powered by Amazon Bedrock to accelerate clinical trials. Since then, Clario has further enhanced their AI capabil…",
    "link": "https://aws.amazon.com/blogs/machine-learning/clario-streamlines-clinical-trial-software-configurations-using-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Introducing Amazon Bedrock cross-Region inference for Claude Sonnet 4.5 and Haiku 4.5 in Japan and Australia",
    "source": "aws.amazon.com",
    "date": "2025-10-31",
    "summary": "こんにちは, G’day. The recent launch of Anthropic’s Claude Sonnet 4.5 and Claude Haiku 4.5, now available on Amazon Bedrock, marks a significant leap forward in generative AI models. These state-of-the-art…",
    "link": "https://aws.amazon.com/blogs/machine-learning/introducing-amazon-bedrock-cross-region-inference-for-claude-sonnet-4-5-and-haiku-4-5-in-japan-and-australia/"
  },
  {
    "category": "News",
    "title": "Reduce CAPTCHAs for AI agents browsing the web with Web Bot Auth (Preview) in Amazon Bedrock AgentCore Browser",
    "source": "aws.amazon.com",
    "date": "2025-10-30",
    "summary": "AI agents need to browse the web on your behalf. When your agent visits a website to gather information, complete a form, or verify data, it encounters the same defenses designed to stop unwanted bots…",
    "link": "https://aws.amazon.com/blogs/machine-learning/reduce-captchas-for-ai-agents-browsing-the-web-with-web-bot-auth-preview-in-amazon-bedrock-agentcore-browser/"
  },
  {
    "category": "News",
    "title": "Preparing for the General Availability of the new Card visual",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-29",
    "summary": "One change may impact the behavior and look of the new card visual in existing reports. The callout size and background setting will be available with or without a divider after GA.…",
    "link": "https://powerbi.microsoft.com/en-us/blog/prepare-for-new-card-visual/"
  },
  {
    "category": "News",
    "title": "Power BI app Copilot: AI scoped to the curated content in an app (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "Announcing Power BI app Copilot, now in preview. With app-scoped Copilot, users can search for reports in an app plus ask questions and get connected with answers based on a report in an app. App Copi…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-app-copilot-ai-scoped-to-the-curated-content-in-an-app-preview/"
  },
  {
    "category": "News",
    "title": "Deprecation Announcement: Office Online Server Retirement and What It Means for Power BI Report Server Users",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "What’s Changing? Microsoft has announced that Office Online Server (OOS) will be retired effective December 31, 2026. As a result, PBIRS users will no longer be able to host Excel workbooks in PBIRS u…",
    "link": "https://powerbi.microsoft.com/en-us/blog/deprecation-announcement-office-online-server-retirement-and-what-it-means-for-power-bi-report-server-users/"
  },
  {
    "category": "News",
    "title": "Introducing Power BI Controller: Streamlining Storytelling with Bulk Operations (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-27",
    "summary": "This feature was developed in direct response to feedback from our user community and is designed to provide an efficient tool for managing multiple Power BI add-ins within PowerPoint presentations. B…",
    "link": "https://powerbi.microsoft.com/en-us/blog/introducing-power-bi-controller-streamlining-storytelling-with-bulk-operations-preview/"
  },
  {
    "category": "News",
    "title": "Introducing Improvements to the Report Copilot in Power BI",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-20",
    "summary": "We’ve upgraded the Report Copilot experience in Power BI, making it easier than ever to create, edit, and refine beautiful, data-rich reports with the help of AI. With this update, Copilot in Power BI…",
    "link": "https://powerbi.microsoft.com/en-us/blog/introducing-improvements-to-the-report-copilot-in-power-bi/"
  }
]