[
  {
    "category": "News",
    "title": "LLM-Powered Time-Series Analysis",
    "source": "towardsdatascience.com",
    "date": "2025-11-09",
    "summary": "Part 2: Prompts for Advanced Model Development The post LLM-Powered Time-Series Analysis appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/llm-powered-time-series-analysis/"
  },
  {
    "category": "News",
    "title": "How to Build Your Own Agentic AI System Using CrewAI",
    "source": "towardsdatascience.com",
    "date": "2025-11-09",
    "summary": "This article demonstrates how to develop your own Agentic AI system using CrewAI framework. By orchestrating specialized agents with distinct roles and tools, we implement a multi-agent team that is c…",
    "link": "https://towardsdatascience.com/how-to-build-your-own-agentic-ai-system-using-crewai/"
  },
  {
    "category": "News",
    "title": "Power Analysis in Marketing: A Hands-On Introduction",
    "source": "towardsdatascience.com",
    "date": "2025-11-08",
    "summary": "Part 1: What is statistical power and how do we compute it? The post Power Analysis in Marketing: A Hands-On Introduction appeared first on Towards Data Science.…",
    "link": "https://towardsdatascience.com/power-analysis-in-marketing/"
  },
  {
    "category": "News",
    "title": "Evaluating Synthetic Data — The Million Dollar Question",
    "source": "towardsdatascience.com",
    "date": "2025-11-07",
    "summary": "Learn how to evaluate synthetic data quality using the Maximum Similarity Test — a simple, quantitative approach for assessing fidelity, utility, and privacy in synthetic datasets. The post Evaluating…",
    "link": "https://towardsdatascience.com/evaluating-synthetic-data-the-million-dollar-question-a54701d1b621/"
  },
  {
    "category": "News",
    "title": "Beyond Numbers: How to Humanize Your Data & Analysis",
    "source": "towardsdatascience.com",
    "date": "2025-11-07",
    "summary": "The scintillating grid optical illusion is a perfect metaphor for how raw data can mislead us, causing us to see false trends. To escape the \"data-rich, action-poor\" paradox, organizations should need…",
    "link": "https://towardsdatascience.com/beyond-numbers-how-to-humanize-your-data-analysis/"
  },
  {
    "category": "News",
    "title": "Connect Amazon Bedrock agents to cross-account knowledge bases",
    "source": "aws.amazon.com",
    "date": "2025-11-07",
    "summary": "Organizations need seamless access to their structured data repositories to power intelligent AI agents. However, when these resources span multiple AWS accounts integration challenges can arise. This…",
    "link": "https://aws.amazon.com/blogs/machine-learning/connect-amazon-bedrock-agents-to-cross-account-knowledge-bases/"
  },
  {
    "category": "News",
    "title": "Democratizing AI: How Thomson Reuters Open Arena supports no-code AI for every professional with Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-07",
    "summary": "In this blog post, we explore how TR addressed key business use cases with Open Arena, a highly scalable and flexible no-code AI solution powered by Amazon Bedrock and other AWS services such as Amazo…",
    "link": "https://aws.amazon.com/blogs/machine-learning/democratizing-ai-how-thomson-reuters-open-arena-supports-no-code-ai-for-every-professional-with-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Introducing structured output for Custom Model Import in Amazon Bedrock",
    "source": "aws.amazon.com",
    "date": "2025-11-07",
    "summary": "Today, we are excited to announce the addition of structured output to Custom Model Import. Structured output constrains a model's generation process in real time so that every token it produces confo…",
    "link": "https://aws.amazon.com/blogs/machine-learning/introducing-structured-output-for-custom-model-import-in-amazon-bedrock/"
  },
  {
    "category": "News",
    "title": "Transform your MCP architecture: Unite MCP servers through AgentCore Gateway",
    "source": "aws.amazon.com",
    "date": "2025-11-06",
    "summary": "Earlier this year, we introduced Amazon Bedrock AgentCore Gateway, a fully managed service that serves as a centralized MCP tool server, providing a unified interface where agents can discover, access…",
    "link": "https://aws.amazon.com/blogs/machine-learning/transform-your-mcp-architecture-unite-mcp-servers-through-agentcore-gateway/"
  },
  {
    "category": "News",
    "title": "How Amazon Search increased ML training twofold using AWS Batch for Amazon SageMaker Training jobs",
    "source": "aws.amazon.com",
    "date": "2025-11-05",
    "summary": "In this post, we show you how Amazon Search optimized GPU instance utilization by leveraging AWS Batch for SageMaker Training jobs. This managed solution enabled us to orchestrate machine learning (ML…",
    "link": "https://aws.amazon.com/blogs/machine-learning/how-amazon-search-increased-ml-training-twofold-using-aws-batch-for-amazon-sagemaker-training-jobs/"
  },
  {
    "category": "News",
    "title": "Power BI semantic models as accelerators for AI-enabled consumption",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-05",
    "summary": "As data volumes grow exponentially, Power BI customers demand AI-driven analytical solutions that scale to petabytes, are secure, governed, and easy to manage. Power BI semantic models, backed by Micr…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-semantic-models-as-accelerators-for-ai-enabled-consumption/"
  },
  {
    "category": "News",
    "title": "Advance your career in Data &amp; AI with Microsoft Fabric Data Days",
    "source": "powerbi.microsoft.com",
    "date": "2025-11-03",
    "summary": "There’s no AI without data. Are you ready to invest in your future? Fabric Data Days starts on November 4th! We’re offering 50+ days of immersive learning designed for data professionals at every leve…",
    "link": "https://powerbi.microsoft.com/en-us/blog/advance-your-career-in-data-ai-with-microsoft-fabric-data-days/"
  },
  {
    "category": "News",
    "title": "Preparing for the General Availability of the new Card visual",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-29",
    "summary": "One change may impact the behavior and look of the new card visual in existing reports. The callout size and background setting will be available with or without a divider after GA.…",
    "link": "https://powerbi.microsoft.com/en-us/blog/prepare-for-new-card-visual/"
  },
  {
    "category": "News",
    "title": "Power BI app Copilot: AI scoped to the curated content in an app (Preview)",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "Announcing Power BI app Copilot, now in preview. With app-scoped Copilot, users can search for reports in an app plus ask questions and get connected with answers based on a report in an app. App Copi…",
    "link": "https://powerbi.microsoft.com/en-us/blog/power-bi-app-copilot-ai-scoped-to-the-curated-content-in-an-app-preview/"
  },
  {
    "category": "News",
    "title": "Deprecation Announcement: Office Online Server Retirement and What it Means for Power BI Report Server Users",
    "source": "powerbi.microsoft.com",
    "date": "2025-10-28",
    "summary": "What’s Changing? Microsoft has announced that Office Online Server (OOS) will be retired effective December 31, 2026. As a result, PBIRS users will no longer be able to host Excel workbooks in PBIRS u…",
    "link": "https://powerbi.microsoft.com/en-us/blog/deprecation-announcement-office-online-server-retirement-and-what-it-means-for-power-bi-report-server-users/"
  }
]